In [1]:
import pandas as pd
import numpy as np

In [25]:
df = pd.read_csv("pivot.csv", sep=';', parse_dates=["Date"])
df.head()

        Date  Region  Employé   Produit  Unité  Prix unitaire     Total
0 2016-06-01     Est     Jean    Crayon     95           1.99   189.05
1 2016-06-01  Centre   jeanne  Classeur     50          19.99    999.5
2 2016-06-01  Centre   Gilles    Crayon     36           4.99   179.64
3 2016-06-01  Centre  Sorvino     Stylo     27          19.99   539.73
4 2016-06-01   Ouest    Kevin    Crayon     56           2.99   167.44

In [18]:
df["Employé"].value_counts()

Jean       8
jeanne     8
Kevin      8
Sorvino    8
Gilles     8
Name: Employé, dtype: int64

In [26]:
df["Employé"] = df["Employé"].astype("category")

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 7 columns):
Date             40 non-null datetime64[ns]
Region           40 non-null object
Employé          40 non-null category
Produit          40 non-null object
Unité            40 non-null int64
Prix unitaire    40 non-null float64
Total            40 non-null object
dtypes: category(1), datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 2.2+ KB

In [27]:
df.pivot(index="Date", columns = "Employé", values="Total")

Employé        Gilles        Jean       Kevin       Sorvino      jeanne
Date
2016-06-01    179.64      189.05      167.44        539.73       999.5
2016-07-07     449.1       299.4       539.4         63.68      149.25
2016-07-13    151.24    825.00         18.06       1139.43        9.03
2016-08-07   1619.19       449.1    250.00          174.65       57.71
2016-09-07    575.36      255.84      479.04        299.85      251.72
2016-10-07    413.54       86.43       19.96    1 305.00       1183.26
2016-11-07    131.34      139.93       68.37        479.04       249.5
2016-12-07    309.38       719.2      1005.9        686.95    625.00